In [1]:
import pandas as pd

In [16]:
var = pd.DataFrame({"A":[1,2,3,4],"B":[5,6,7,8]})
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

In [17]:
var["C"] = var["A"]+var["B"]
var

   A  B   C
0  1  5   6
1  2  6   8
2  3  7  10
3  4  8  12

In [18]:
var["C"] = var["A"] - var["B"]
var

   A  B  C
0  1  5 -4
1  2  6 -4
2  3  7 -4
3  4  8 -4

In [19]:
var["C"] = var["A"] * var["B"]
var

   A  B   C
0  1  5   5
1  2  6  12
2  3  7  21
3  4  8  32

In [20]:
var["C"] = var["A"] / var["B"]
var

   A  B         C
0  1  5  0.200000
1  2  6  0.333333
2  3  7  0.428571
3  4  8  0.500000

In [22]:
var1 = pd.DataFrame({"A":[12,22,13,42,51],"B":[5,6,7,8,9]})
var1

    A  B
0  12  5
1  22  6
2  13  7
3  42  8
4  51  9

In [23]:
var1["Python"] = var1["A"] <= 15

In [25]:
var1

    A  B  Python
0  12  5    True
1  22  6   False
2  13  7    True
3  42  8   False
4  51  9   False